In [70]:
import pandas as pd
import numpy as np 
import numpy.linalg as la

In [71]:
family = pd.read_csv('famb.data', delim_whitespace=True, header=None, index_col=0)

In [72]:
family

       1   2  3  4  5         6  7   8
0
1     12  12  1  1  1  70161.04  0  99
2     12  12  1  1  0  17043.12  0  33
3     12  10  4  1  0  34078.22  0  55
4     12  12  1  1  1  44101.23  0  83
5     12  12  2  1  1  88202.45  0  94
...   ..  .. .. .. ..       ... ..  ..
1706  11   8  8  1  1  11025.31  0  29
1707  11  11  1  0  0  12027.61  0  23
1708  12   8  3  1  1  12829.45  0  94
1709  12  16  3  1  1   3808.74  0  83
1710   9   8  3  1  1  12428.53  0  69

[1710 rows x 8 columns]

In [73]:
family = family.rename(columns={1: 'Mom_educ', 2: 'Dad_educ', 3: 'Num_siblings', 4: 'Urban', 5:'Nuclear', 6:'Family_income', 7:'South', 8:'AFQT_score'})

In [74]:
family = family.replace(-9999, np.nan)

In [75]:
family

,Mom_educ,Dad_educ,Num_siblings,Urban,Nuclear,Family_income,South,AFQT_score
0,,,,,,,,
1,12,12,1,1,1,70161.04,0,99
2,12,12,1,1,0,17043.12,0,33
3,12,10,4,1,0,34078.22,0,55
4,12,12,1,1,1,44101.23,0,83
5,12,12,2,1,1,88202.45,0,94
...,...,...,...,...,...,...,...,...
1706,11,8,8,1,1,11025.31,0,29
1707,11,11,1,0,0,12027.61,0,23
1708,12,8,3,1,1,12829.45,0,94
1709,12,16,3,1,1,3808.74,0,83
1710,9,8,3,1,1,12428.53,0,69

In [76]:
column_values = family['Family_income'].values

In [77]:
column_values

array([70161.04, 17043.12, 34078.22, ..., 12829.45,  3808.74, 12428.53])

In [78]:
sorted(column_values)

[0.0,
 0.0,
 0.0,
 0.0,
 0.0,
 0.0,
 601.38,
 641.47,
 1002.3,
 1202.76,
 1423.27,
 1603.68,
 1643.77,
 1764.05,
 2205.06,
 2405.52,
 2455.64,
 2505.75,
 2605.98,
 2605.98,
 2605.98,
 2656.1,
 2806.44,
 2806.44,
 2846.53,
 2934.74,
 3006.9,
 3006.9,
 3111.14,
 3207.36,
 3247.45,
 3247.45,
 3419.85,
 3608.28,
 3608.28,
 3720.54,
 3808.74,
 3923.0,
 4009.2,
 4009.2,
 4009.2,
 4009.2,
 4009.2,
 4009.2,
 4009.2,
 4209.66,
 4426.16,
 4610.58,
 4610.58,
 4670.72,
 5011.5,
 5011.5,
 5011.5,
 5011.5,
 5011.5,
 5221.99,
 5392.38,
 5412.42,
 5412.42,
 5612.88,
 5677.03,
 5717.12,
 5813.34,
 5833.39,
 5897.54,
 5913.57,
 5913.57,
 5965.69,
 6007.79,
 6013.8,
 6013.8,
 6013.8,
 6013.8,
 6013.8,
 6013.8,
 6013.8,
 6033.85,
 6053.9,
 6114.03,
 6158.13,
 6214.26,
 6214.26,
 6226.29,
 6274.4,
 6350.58,
 6414.72,
 6414.72,
 6422.74,
 6595.14,
 6615.18,
 6615.18,
 6615.18,
 6715.41,
 6735.46,
 6755.51,
 6785.58,
 6815.64,
 6835.69,
 6847.72,
 6875.78,
 6976.01,
 7016.1,
 7016.1,
 7016.1,
 7016.1,
 7016.1,
 7056.2,
 7168.45,
 7216.56,
 7216.56,
 7216.56,
 7216.56,
 7396.98,
 7517.25,
 7517.25,
 7579.4,
 7593.43,
 7597.44,
 7617.48,
 7617.48,
 7645.55,
 7745.78,
 7817.94,
 7916.17,
 8018.4,
 8018.4,
 8018.4,
 8018.4,
 8018.4,
 8018.4,
 8018.4,
 8018.4,
 8018.4,
 8018.4,
 8018.4,
 8018.4,
 8018.4,
 8018.4,
 8018.4,
 8018.4,
 8018.4,
 8018.4,
 8058.5,
 8128.66,
 8178.77,
 8202.83,
 8218.87,
 8218.87,
 8399.28,
 8447.39,
 8479.46,
 8619.79,
 8619.79,
 8820.25,
 8900.43,
 8924.48,
 8980.61,
 9020.71,
 9020.71,
 9181.07,
 9481.76,
 9521.86,
 9622.09,
 9622.09,
 9622.09,
 9622.09,
 9662.18,
 9814.53,
 9822.55,
 9922.78,
 9972.89,
 10023.01,
 10023.01,
 10023.01,
 10023.01,
 10023.01,
 10023.01,
 10023.01,
 10023.01,
 10023.01,
 10023.01,
 10023.01,
 10023.01,
 10023.01,
 10023.01,
 10023.01,
 10023.01,
 10023.01,
 10023.01,
 10023.01,
 10023.01,
 10023.01,
 10023.01,
 10023.01,
 10023.01,
 10027.02,
 10031.02,
 10031.02,
 10031.02,
 10039.04,
 10071.12,
 10071.12,
 10103.19,
 10103.19,
 10113.21,
 10123.24,
 10127.25,
 10147.29,
 10223.47,
 10263.56,
 10307.66,
 10323.7,
 10323.7,
 10343.74,
 10391.85,
 10407.89,
 10451.99,
 10454.0,
 10524.16,
 10524.16,
 10560.24,
 10560.24,
 10624.39,
 10624.39,
 10624.39,
 10664.48,
 10744.66,
 10824.85,
 10824.85,
 10824.85,
 10858.92,
 10858.92,
 10874.96,
 10880.98,
 10925.08,
 11025.31,
 11025.31,
 11025.31,
 11025.31,
 11025.31,
 11025.31,
 11025.31,
 11025.31,
 11025.31,
 11025.31,
 11025.31,
 11025.31,
 11025.31,
 11091.46,
 11105.49,
 11129.55,
 11129.55,
 11195.7,
 11205.72,
 11225.77,
 11225.77,
 11225.77,
 11225.77,
 11265.86,
 11338.02,
 11346.04,
 11376.11,
 11406.18,
 11426.23,
 11426.23,
 11460.31,
 11486.37,
 11576.57,
 11626.69,
 11626.69,
 11626.69,
 11626.69,
 11626.69,
 11646.73,
 11779.04,
 11779.04,
 11807.1,
 11927.38,
 11927.38,
 11947.42,
 12017.58,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12027.61,
 12037.63,
 12047.65,
 12087.75,
 12127.84,
 12147.88,
 12228.07,
 12228.07,
 12228.07,
 12228.07,
 12228.07,
 12388.44,
 12428.53,
 12428.53,
 12428.53,
 12428.53,
 12428.53,
 12484.66,
 12624.98,
 12649.03,
 12797.37,
 12819.42,
 12823.43,
 12829.45,
 12829.45,
 12893.6,
 12929.68,
 12929.68,
 12949.72,
 12989.82,
 13009.86,
 13029.91,
 13029.91,
 13029.91,
 13029.91,
 13029.91,
 13029.91,
 13029.91,
 13029.91,
 13029.91,
 13230.37,
 13230.37,
 13230.37,
 13230.37,
 13270.46,
 13330.6,
 13330.6,
 13511.01,
 13581.17,
 13621.27,
 13631.29,
 13631.29,
 13631.29,
 13673.38,
 13711.47,
 13731.52,
 13807.69,
 13823.73,
 13831.75,
 14032.21,
 14032.21,
 14032.21,
 14032.21,
 14032.21,
 14032.21,
 14032.21,
 14032.21,
 14032.21,
 14032.21,
 14032.21,
 14032.21,
 14032.21,
 14032.21,
 14032.21,
 14032.21,
 14032.21,
 14032.21,
 14032.21,
 14032.21,
 14032.21,
 14032.21,
 14032.21,
 14032.21,
 14032.21,
 14032.21,
 14052.25,
 14072.3,
 14088.34,
 14192.58,
 14284.79,
 14320.87,
 14433.13,
 14433.13,
 14433.13,
 14433.13,
 14433.13,
 14533.36,
 14537.37,
 14569.44,
 14569.44,
 14569.44,
 14591.49,
 14591.49,
 14605.52,
 14609.53,
 14609.53,
 14633.59,
 14733.82,
 14769.9,
 14834.05,
 14858.1,
 14990.41,
 15034.51,
 15034.51,
 15034.51,
 15034.51,
 15034.51,
 15034.51,
 15034.51,
 15034.51,
 15034.51,
 15034.51,
 15034.51,
 15234.97,
 15234.97,
 15359.25,
 15499.58,
 15595.8,
 15627.87,
 15635.89,
 15635.89,
 15720.08,
 15870.43,
 15936.58,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16036.81,
 16064.87,
 16237.27,
 16237.27,
 16397.64,
 16467.8,
 16576.05,
 16582.06,
 16582.06,
 16606.12,
 16606.12,
 16618.14,
 16804.57,
 16838.65,
 16856.69,
 16982.98,
 17039.11,
 17039.11,
 17039.11,
 17039.11,
 17039.11,
 17039.11,
 17043.12,
 17239.57,
 17239.57,
 17239.57,
 17440.03,
 17550.28,
 17560.31,
 17640.49,
 17640.49,
 17640.49,
 17640.49,
 17666.55,
 17840.95,
 17840.95,
 17840.95,
 17840.95,
 17981.27,
 18009.34,
 18031.39,
 18041.41,
 18041.41,
 18041.41,
 18041.41,
 18041.41,
 18041.41,
 18041.41,
 18041.41,
 18041.41,
 18041.41,
 18041.41,
 18041.41,
 18041.41,
 18041.41,
 18041.41,
 18041.41,
 18041.41,
 18041.41,
 18041.41,
 18041.41,
 18121.6,
 18185.74,
 18185.74,
 18241.87,
 18372.17,
 18442.33,
 18502.47,
 18522.52,
 18522.52,
 18542.56,
 18769.08,
 18843.25,
 18945.49,
 19043.71,
 19043.71,
 19043.71,
 19196.06,
 19196.06,
 19204.08,
 19378.48,
 19390.51,
 19422.58,
 19470.69,
 19492.74,
 19492.74,
 19494.75,
 19570.92,
 19645.09,
 19685.18,
 19785.41,
 19889.65,
 20015.94,
 20015.94,
 20046.01,
 20046.01,
 20046.01,
 20046.01,
 20046.01,
 20046.01,
 20046.01,
 20046.01,
 20046.01,
 20046.01,
 20046.01,
 20046.01,
 20046.01,
 20046.01,
 20046.01,
 20046.01,
 20046.01,
 20046.01,
 20046.01,
 20046.01,
 20046.01,
 20046.01,
 20046.01,
 20046.01,
 20046.01,
 20046.01,
 20046.01,
 20046.01,
 20046.01,
 20046.01,
 20046.01,
 20046.01,
 20446.93,
 20446.93,
 20543.15,
 20591.26,
 20647.39,
 20847.85,
 21024.26,
 21048.31,
 21048.31,
 21096.42,
 21100.43,
 21168.59,
 21248.77,
 21248.77,
 21248.77,
 21649.69,
 21649.69,
 21649.69,
 21950.38,
 21994.48,
 22050.61,
 22050.61,
 22050.61,
 22050.61,
 22050.61,
 22050.61,
 22050.61,
 22050.61,
 22050.61,
 22050.61,
 22050.61,
 22050.61,
 22050.61,
 22050.61,
 22050.61,
 22451.53,
 22451.53,
 22451.53,
 22451.53,
 22910.59,
 23036.88,
 23052.91,
 23052.91,
 23052.91,
 23339.57,
 23588.14,
 23854.75,
 23854.75,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24055.21,
 24073.26,
 24115.35,
 24151.44,
 24556.37,
 24778.88,
 24945.26,
 25007.4,
 25057.52,
 25057.52,
 25057.52,
 25057.52,
 25057.52,
 25257.98,
 25257.98,
 25257.98,
 25257.98,
 25458.44,
 25658.9,
 26059.82,
 26059.82,
 26059.82,
 26059.82,
 26059.82,
 26059.82,
 26059.82,
 26059.82,
 26059.82,
 26059.82,
 26059.82,
 26059.82,
 26059.82,
 26059.82,
 26059.82,
 26059.82,
 26059.82,
 26059.82,
 26059.82,
 26059.82,
 26324.42,
 26370.53,
 26380.55,
 26661.2,
 26879.7,
 27062.12,
 27062.12,
 27062.12,
 27062.12,
 27062.12,
 27062.12,
 27352.78,
 27463.04,
 27583.31,
 27663.5,
 27663.5,
 27663.5,
 27721.63,
 27863.96,
 28064.42,
 28064.42,
 28064.42,
 28064.42,
 28064.42,
 28064.42,
 28064.42,
 28064.42,
 28064.42,
 28064.42,
 28064.42,
 28064.42,
 28064.42,
 28064.42,
 28064.42,
 28064.42,
 28064.42,
 28064.42,
 28064.42,
 28064.42,
 28064.42,
 28064.42,
 28064.42,
 28162.64,
 28713.91,
 28713.91,
 28866.26,
 29066.72,
 29066.72,
 29066.72,
 29309.27,
 29607.96,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30069.02,
 30129.16,
 30169.25,
 30469.94,
 30469.94,
 30469.94,
 30670.4,
 30670.4,
 30870.86,
 31071.32,
 31071.32,
 31071.32,
 31071.32,
 31171.55,
 31432.15,
 31546.41,
 31849.1,
 32073.62,
 32073.62,
 32073.62,
 32073.62,
 32073.62,
 32073.62,
 32073.62,
 32073.62,
 32073.62,
 32073.62,
 32073.62,
 32073.62,
 32073.62,
 32073.62,
 32073.62,
 32073.62,
 32073.62,
 32073.62,
 32073.62,
 32073.62,
 32201.91,
 32715.09,
 32915.55,
 32971.68,
 33075.92,
 33075.92,
 33677.3,
 33855.71,
 33877.76,
 34078.22,
 34078.22,
 34078.22,
 34078.22,
 34078.22,
 34078.22,
 34078.22,
 34078.22,
 34078.22,
 34078.22,
 34078.22,
 34078.22,
 34078.22,
 34078.22,
 34078.22,
 34078.22,
 34078.22,
 34078.22,
 34078.22,
 34078.22,
 34078.22,
 34078.22,
 34078.22,
 34078.22,
 34078.22,
 34078.22,
 34134.35,
 34210.52,
 34278.68,
 34278.68,
 34435.04,
 34479.14,
 34479.14,
 34605.43,
 34679.6,
 34679.6,
 34880.06,
 34880.06,
 35080.52,
 35080.52,
 35080.52,
 35327.09,
 36082.82,
 36082.82,
 36082.82,
 36082.82,
 36082.82,
 36082.82,
 36082.82,
 36082.82,
 36082.82,
 36082.82,
 36082.82,
 36082.82,
 36082.82,
 36082.82,
 36082.82,
 36082.82,
 36082.82,
 36082.82,
 36082.82,
 36082.82,
 36082.82,
 36082.82,
 36082.82,
 36082.82,
 36082.82,
 36082.82,
 36082.82,
 36082.82,
 36082.82,
 36082.82,
 36082.82,
 36082.82,
 36082.82,
 36163.01,
 36980.88,
 37085.12,
 37085.12,
 37636.39,
 37772.7,
 37772.7,
 38087.42,
 38087.42,
 38087.42,
 38087.42,
 38087.42,
 38087.42,
 38087.42,
 38087.42,
 38087.42,
 38087.42,
 38087.42,
 38087.42,
 38087.42,
 38087.42,
 38087.42,
 38087.42,
 38087.42,
 38087.42,
 38087.42,
 38087.42,
 38087.42,
 38873.23,
 38873.23,
 39490.64,
 40041.91,
 40092.02,
 40092.02,
 ...]

In [ ]:
#hej

In [79]:
for column in family.columns:
    # Find the minimum value of the column
    min_value = family[column].min()

    # Find the maximum value of the column
    max_value = family[column].max()

    print(column)
    print("Minimum value:", min_value)
    print("Maximum value:", max_value)
    print('-----------------')

Mom_educ
Minimum value: 0
Maximum value: 20
-----------------
Dad_educ
Minimum value: 0
Maximum value: 20
-----------------
Num_siblings
Minimum value: 0
Maximum value: 15
-----------------
Urban
Minimum value: 0
Maximum value: 1
-----------------
Nuclear
Minimum value: 0
Maximum value: 1
-----------------
Family_income
Minimum value: 0.0
Maximum value: 150347.1
-----------------
South
Minimum value: 0
Maximum value: 1
-----------------
AFQT_score
Minimum value: 1
Maximum value: 99
-----------------

In [80]:
edu = pd.read_csv('ed.data', delim_whitespace=True, header=None, index_col=0)
edu

      1   2   3   4   5   6   7   8   9   10  11  12
0
1     12  13  14  15  16  16  16  16  16  16  16  16
2      8   9  10  11  12  12  12  12  12  12  12  12
3      9  10  11  12  12  12  12  13  13  13  13  14
4      8   9  10  11  12  13  14  15  16  16  16  16
5     13  13  14  14  15  15  15  15  15  15  15  15
...   ..  ..  ..  ..  ..  ..  ..  ..  ..  ..  ..  ..
1706  10  10  10  10  10  10  10  10  10  10  10  10
1707  12  12  12  12  12  12  12  12  12  12  12  12
1708  12  12  12  12  12  13  13  13  13  13  13  13
1709  12  12  12  12  12  12  12  12  12  12  12  12
1710  10  12  12  12  12  12  12  12  12  12  12  12

[1710 rows x 12 columns]

In [81]:
new_column_names = [str(year) for year in range(1979, 1991)]

# Rename the columns
edu.columns = new_column_names

In [82]:
edu = edu.replace(-9999, np.nan)
edu

      1979  1980  1981  1982  1983  1984  1985  1986  1987  1988  1989  1990
0
1       12    13    14    15    16    16    16    16    16    16    16    16
2        8     9    10    11    12    12    12    12    12    12    12    12
3        9    10    11    12    12    12    12    13    13    13    13    14
4        8     9    10    11    12    13    14    15    16    16    16    16
5       13    13    14    14    15    15    15    15    15    15    15    15
...    ...   ...   ...   ...   ...   ...   ...   ...   ...   ...   ...   ...
1706    10    10    10    10    10    10    10    10    10    10    10    10
1707    12    12    12    12    12    12    12    12    12    12    12    12
1708    12    12    12    12    12    13    13    13    13    13    13    13
1709    12    12    12    12    12    12    12    12    12    12    12    12
1710    10    12    12    12    12    12    12    12    12    12    12    12

[1710 rows x 12 columns]

In [83]:
shifted_edu = edu.shift(-1,axis=1)
shifted_edu

      1979  1980  1981  1982  1983  1984  1985  1986  1987  1988  1989  1990
0
1       13    14    15    16    16    16    16    16    16    16    16   NaN
2        9    10    11    12    12    12    12    12    12    12    12   NaN
3       10    11    12    12    12    12    13    13    13    13    14   NaN
4        9    10    11    12    13    14    15    16    16    16    16   NaN
5       13    14    14    15    15    15    15    15    15    15    15   NaN
...    ...   ...   ...   ...   ...   ...   ...   ...   ...   ...   ...   ...
1706    10    10    10    10    10    10    10    10    10    10    10   NaN
1707    12    12    12    12    12    12    12    12    12    12    12   NaN
1708    12    12    12    12    13    13    13    13    13    13    13   NaN
1709    12    12    12    12    12    12    12    12    12    12    12   NaN
1710    12    12    12    12    12    12    12    12    12    12    12   NaN

[1710 rows x 12 columns]

In [84]:
edu.describe()

,1979,1980,1981,1982,1983,1984,1985,1986,1987,1988,1989,1990
count,1710.000000,1710.000000,1710.000000,1710.000000,1710.000000,1710.000000,1710.000000,1710.000000,1710.000000,1710.000000,1710.000000,1710.000000
mean,9.980702,10.663743,11.214035,11.662573,11.990058,12.218713,12.378363,12.514620,12.618713,12.716959,12.768421,12.808187
std,1.779271,1.668847,1.656179,1.713934,1.833444,1.993289,2.152495,2.284752,2.405791,2.509317,2.549716,2.579920
min,6.000000,6.000000,6.000000,6.000000,6.000000,6.000000,6.000000,6.000000,6.000000,6.000000,6.000000,6.000000
25%,9.000000,9.000000,10.000000,11.000000,11.000000,12.000000,12.000000,12.000000,12.000000,12.000000,12.000000,12.000000
50%,10.000000,11.000000,11.000000,12.000000,12.000000,12.000000,12.000000,12.000000,12.000000,12.000000,12.000000,12.000000
75%,11.000000,12.000000,12.000000,12.000000,13.000000,13.000000,14.000000,14.000000,14.000000,14.000000,14.000000,14.000000
max,15.000000,16.000000,17.000000,18.000000,19.000000,19.000000,20.000000,20.000000,20.000000,20.000000,20.000000,20.000000

In [85]:
dummy_school = shifted_edu -edu 
dummy_school

      1979  1980  1981  1982  1983  1984  1985  1986  1987  1988  1989  1990
0
1        1     1     1     1     0     0     0     0     0     0     0   NaN
2        1     1     1     1     0     0     0     0     0     0     0   NaN
3        1     1     1     0     0     0     1     0     0     0     1   NaN
4        1     1     1     1     1     1     1     1     0     0     0   NaN
5        0     1     0     1     0     0     0     0     0     0     0   NaN
...    ...   ...   ...   ...   ...   ...   ...   ...   ...   ...   ...   ...
1706     0     0     0     0     0     0     0     0     0     0     0   NaN
1707     0     0     0     0     0     0     0     0     0     0     0   NaN
1708     0     0     0     0     1     0     0     0     0     0     0   NaN
1709     0     0     0     0     0     0     0     0     0     0     0   NaN
1710     2     0     0     0     0     0     0     0     0     0     0   NaN

[1710 rows x 12 columns]

In [86]:
dummy_school = dummy_school.drop(columns='1990')
dummy_school

      1979  1980  1981  1982  1983  1984  1985  1986  1987  1988  1989
0
1        1     1     1     1     0     0     0     0     0     0     0
2        1     1     1     1     0     0     0     0     0     0     0
3        1     1     1     0     0     0     1     0     0     0     1
4        1     1     1     1     1     1     1     1     0     0     0
5        0     1     0     1     0     0     0     0     0     0     0
...    ...   ...   ...   ...   ...   ...   ...   ...   ...   ...   ...
1706     0     0     0     0     0     0     0     0     0     0     0
1707     0     0     0     0     0     0     0     0     0     0     0
1708     0     0     0     0     1     0     0     0     0     0     0
1709     0     0     0     0     0     0     0     0     0     0     0
1710     2     0     0     0     0     0     0     0     0     0     0

[1710 rows x 11 columns]

In [87]:
# drop the first column 
dummy_school = dummy_school.drop(columns='1979')
dummy_school

      1980  1981  1982  1983  1984  1985  1986  1987  1988  1989
0
1        1     1     1     0     0     0     0     0     0     0
2        1     1     1     0     0     0     0     0     0     0
3        1     1     0     0     0     1     0     0     0     1
4        1     1     1     1     1     1     1     0     0     0
5        1     0     1     0     0     0     0     0     0     0
...    ...   ...   ...   ...   ...   ...   ...   ...   ...   ...
1706     0     0     0     0     0     0     0     0     0     0
1707     0     0     0     0     0     0     0     0     0     0
1708     0     0     0     1     0     0     0     0     0     0
1709     0     0     0     0     0     0     0     0     0     0
1710     0     0     0     0     0     0     0     0     0     0

[1710 rows x 10 columns]

In [88]:
#diff_edu = edu.diff(axis=1)

In [89]:
#diff_edu

In [90]:
#dummy_school = (diff_edu > 0).astype(int)
#drop the first column
#dummy_school = dummy_school.drop('1979', axis=1)
#dummy_school

In [91]:
edu

      1979  1980  1981  1982  1983  1984  1985  1986  1987  1988  1989  1990
0
1       12    13    14    15    16    16    16    16    16    16    16    16
2        8     9    10    11    12    12    12    12    12    12    12    12
3        9    10    11    12    12    12    12    13    13    13    13    14
4        8     9    10    11    12    13    14    15    16    16    16    16
5       13    13    14    14    15    15    15    15    15    15    15    15
...    ...   ...   ...   ...   ...   ...   ...   ...   ...   ...   ...   ...
1706    10    10    10    10    10    10    10    10    10    10    10    10
1707    12    12    12    12    12    12    12    12    12    12    12    12
1708    12    12    12    12    12    13    13    13    13    13    13    13
1709    12    12    12    12    12    12    12    12    12    12    12    12
1710    10    12    12    12    12    12    12    12    12    12    12    12

[1710 rows x 12 columns]

In [92]:
# shift so that the value in 1980 is the value from 1979
edu_going_in = edu.shift(1, axis=1)
edu_going_in

      1979  1980  1981  1982  1983  1984  1985  1986  1987  1988  1989  1990
0
1      NaN    12    13    14    15    16    16    16    16    16    16    16
2      NaN     8     9    10    11    12    12    12    12    12    12    12
3      NaN     9    10    11    12    12    12    12    13    13    13    13
4      NaN     8     9    10    11    12    13    14    15    16    16    16
5      NaN    13    13    14    14    15    15    15    15    15    15    15
...    ...   ...   ...   ...   ...   ...   ...   ...   ...   ...   ...   ...
1706   NaN    10    10    10    10    10    10    10    10    10    10    10
1707   NaN    12    12    12    12    12    12    12    12    12    12    12
1708   NaN    12    12    12    12    12    13    13    13    13    13    13
1709   NaN    12    12    12    12    12    12    12    12    12    12    12
1710   NaN    10    12    12    12    12    12    12    12    12    12    12

[1710 rows x 12 columns]

In [93]:
edu_going_in = edu.drop(['1990','1979'], axis=1)

In [94]:
edu_going_in

      1980  1981  1982  1983  1984  1985  1986  1987  1988  1989
0
1       13    14    15    16    16    16    16    16    16    16
2        9    10    11    12    12    12    12    12    12    12
3       10    11    12    12    12    12    13    13    13    13
4        9    10    11    12    13    14    15    16    16    16
5       13    14    14    15    15    15    15    15    15    15
...    ...   ...   ...   ...   ...   ...   ...   ...   ...   ...
1706    10    10    10    10    10    10    10    10    10    10
1707    12    12    12    12    12    12    12    12    12    12
1708    12    12    12    12    13    13    13    13    13    13
1709    12    12    12    12    12    12    12    12    12    12
1710    12    12    12    12    12    12    12    12    12    12

[1710 rows x 10 columns]

In [95]:
dummy_school

      1980  1981  1982  1983  1984  1985  1986  1987  1988  1989
0
1        1     1     1     0     0     0     0     0     0     0
2        1     1     1     0     0     0     0     0     0     0
3        1     1     0     0     0     1     0     0     0     1
4        1     1     1     1     1     1     1     0     0     0
5        1     0     1     0     0     0     0     0     0     0
...    ...   ...   ...   ...   ...   ...   ...   ...   ...   ...
1706     0     0     0     0     0     0     0     0     0     0
1707     0     0     0     0     0     0     0     0     0     0
1708     0     0     0     1     0     0     0     0     0     0
1709     0     0     0     0     0     0     0     0     0     0
1710     0     0     0     0     0     0     0     0     0     0

[1710 rows x 10 columns]

In [96]:
dummy_school.index.name = 'id'

panel_dummy_school = dummy_school.reset_index().melt(id_vars='id', var_name ='Year', value_name='Dummy_school')
# panel_dummy = panel_dummy.drop(columns='id')
panel_dummy_school

         id  Year  Dummy_school
0         1  1980             1
1         2  1980             1
2         3  1980             1
3         4  1980             1
4         5  1980             1
...     ...   ...           ...
17095  1706  1989             0
17096  1707  1989             0
17097  1708  1989             0
17098  1709  1989             0
17099  1710  1989             0

[17100 rows x 3 columns]

In [97]:
edu.index.name = 'id'

panel_edu = edu.reset_index().melt(id_vars='id', var_name='Year', value_name='Education')
#panel_edu = panel_edu.drop(columns='id')
panel_edu

         id  Year  Education
0         1  1979         12
1         2  1979          8
2         3  1979          9
3         4  1979          8
4         5  1979         13
...     ...   ...        ...
20515  1706  1990         10
20516  1707  1990         12
20517  1708  1990         13
20518  1709  1990         12
20519  1710  1990         12

[20520 rows x 3 columns]

In [98]:
edu_going_in
edu_going_in.index.name = 'id'
 
panel_edu_going_in = edu_going_in.reset_index().melt(id_vars='id', var_name='Year', value_name='Education_going_in')
panel_edu = panel_edu.drop(columns='id')
panel_edu_going_in

         id  Year  Education_going_in
0         1  1980                  13
1         2  1980                   9
2         3  1980                  10
3         4  1980                   9
4         5  1980                  13
...     ...   ...                 ...
17095  1706  1989                  10
17096  1707  1989                  12
17097  1708  1989                  13
17098  1709  1989                  12
17099  1710  1989                  12

[17100 rows x 3 columns]

In [99]:
# Find the minimum value of the DataFrame excluding the first column
min_value = edu.iloc[:, 1:].values.min()

# Find the maximum value of the DataFrame excluding the first column
max_value = edu.iloc[:, 1:].values.max()

print("Minimum value of the DataFrame (excluding the identifier column):", min_value)
print("Maximum value of the DataFrame (excluding the identifier column):", max_value)

Minimum value of the DataFrame (excluding the identifier column): 6
Maximum value of the DataFrame (excluding the identifier column): 20

In [100]:
exp = pd.read_csv('exp.data', delim_whitespace=True, header=None, index_col=0)

In [101]:
# Rename the columns
exp.columns = new_column_names

In [102]:
exp = exp.replace(-9999, np.nan)

In [103]:
exp.index.name = 'id'

panel_exp = exp.reset_index().melt(id_vars='id', var_name='Year', value_name='Experience')
panel_exp

         id  Year  Experience
0         1  1979         0.0
1         2  1979         0.0
2         3  1979         0.0
3         4  1979         0.0
4         5  1979         0.0
...     ...   ...         ...
20515  1706  1990         NaN
20516  1707  1990         NaN
20517  1708  1990         NaN
20518  1709  1990         NaN
20519  1710  1990         NaN

[20520 rows x 3 columns]

In [104]:
exp

      1979  1980  1981  1982  1983  1984  1985  1986  1987  1988  1989  1990
id
1      0.0   0.0   0.0  0.00  0.58  1.33  2.33  3.33  4.33  5.33  6.33  7.33
2      0.0   0.0   0.0  0.00  0.00  0.00  0.00  0.00  0.00  0.00  1.00  2.00
3      0.0   0.0   0.0  0.00  0.00  0.00  0.00  0.00  0.00  1.00  2.00  3.00
4      0.0   0.0   0.0  0.00  0.00  0.00  0.00  0.00  0.00  0.00  0.00  1.00
5      0.0   0.0   0.0  0.00  0.00  0.00  0.00  0.00  0.00  0.00  0.00  0.00
...    ...   ...   ...   ...   ...   ...   ...   ...   ...   ...   ...   ...
1706   1.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
1707   1.0   2.0   3.0  3.33  4.33  5.33   NaN   NaN   NaN   NaN   NaN   NaN
1708   1.0   2.0   3.0  4.00   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
1709   1.0   2.0   3.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
1710   1.0   2.0   3.0  4.00  5.00  6.00   NaN   NaN   NaN   NaN   NaN   NaN

[1710 rows x 12 columns]

In [105]:
diff_exp = exp.diff(axis=1)
diff_exp

      1979  1980  1981  1982  1983  1984  1985  1986  1987  1988  1989  1990
id
1      NaN   0.0   0.0  0.00  0.58  0.75   1.0   1.0   1.0   1.0   1.0   1.0
2      NaN   0.0   0.0  0.00  0.00  0.00   0.0   0.0   0.0   0.0   1.0   1.0
3      NaN   0.0   0.0  0.00  0.00  0.00   0.0   0.0   0.0   1.0   1.0   1.0
4      NaN   0.0   0.0  0.00  0.00  0.00   0.0   0.0   0.0   0.0   0.0   1.0
5      NaN   0.0   0.0  0.00  0.00  0.00   0.0   0.0   0.0   0.0   0.0   0.0
...    ...   ...   ...   ...   ...   ...   ...   ...   ...   ...   ...   ...
1706   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
1707   NaN   1.0   1.0  0.33  1.00  1.00   NaN   NaN   NaN   NaN   NaN   NaN
1708   NaN   1.0   1.0  1.00   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
1709   NaN   1.0   1.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
1710   NaN   1.0   1.0  1.00  1.00  1.00   NaN   NaN   NaN   NaN   NaN   NaN

[1710 rows x 12 columns]

In [106]:
dummy_work = (diff_exp > 0).astype(int)
dummy_work

      1979  1980  1981  1982  1983  1984  1985  1986  1987  1988  1989  1990
id
1        0     0     0     0     1     1     1     1     1     1     1     1
2        0     0     0     0     0     0     0     0     0     0     1     1
3        0     0     0     0     0     0     0     0     0     1     1     1
4        0     0     0     0     0     0     0     0     0     0     0     1
5        0     0     0     0     0     0     0     0     0     0     0     0
...    ...   ...   ...   ...   ...   ...   ...   ...   ...   ...   ...   ...
1706     0     0     0     0     0     0     0     0     0     0     0     0
1707     0     1     1     1     1     1     0     0     0     0     0     0
1708     0     1     1     1     0     0     0     0     0     0     0     0
1709     0     1     1     0     0     0     0     0     0     0     0     0
1710     0     1     1     1     1     1     0     0     0     0     0     0

[1710 rows x 12 columns]

In [107]:
# drop the first column
dummy_work = dummy_work.drop('1979', axis=1)
dummy_work

      1980  1981  1982  1983  1984  1985  1986  1987  1988  1989  1990
id
1        0     0     0     1     1     1     1     1     1     1     1
2        0     0     0     0     0     0     0     0     0     1     1
3        0     0     0     0     0     0     0     0     1     1     1
4        0     0     0     0     0     0     0     0     0     0     1
5        0     0     0     0     0     0     0     0     0     0     0
...    ...   ...   ...   ...   ...   ...   ...   ...   ...   ...   ...
1706     0     0     0     0     0     0     0     0     0     0     0
1707     1     1     1     1     1     0     0     0     0     0     0
1708     1     1     1     0     0     0     0     0     0     0     0
1709     1     1     0     0     0     0     0     0     0     0     0
1710     1     1     1     1     1     0     0     0     0     0     0

[1710 rows x 11 columns]

In [108]:
# drop the last column 
dummy_work = dummy_work.drop('1990', axis=1)
dummy_work

      1980  1981  1982  1983  1984  1985  1986  1987  1988  1989
id
1        0     0     0     1     1     1     1     1     1     1
2        0     0     0     0     0     0     0     0     0     1
3        0     0     0     0     0     0     0     0     1     1
4        0     0     0     0     0     0     0     0     0     0
5        0     0     0     0     0     0     0     0     0     0
...    ...   ...   ...   ...   ...   ...   ...   ...   ...   ...
1706     0     0     0     0     0     0     0     0     0     0
1707     1     1     1     1     1     0     0     0     0     0
1708     1     1     1     0     0     0     0     0     0     0
1709     1     1     0     0     0     0     0     0     0     0
1710     1     1     1     1     1     0     0     0     0     0

[1710 rows x 10 columns]

In [109]:
exp

      1979  1980  1981  1982  1983  1984  1985  1986  1987  1988  1989  1990
id
1      0.0   0.0   0.0  0.00  0.58  1.33  2.33  3.33  4.33  5.33  6.33  7.33
2      0.0   0.0   0.0  0.00  0.00  0.00  0.00  0.00  0.00  0.00  1.00  2.00
3      0.0   0.0   0.0  0.00  0.00  0.00  0.00  0.00  0.00  1.00  2.00  3.00
4      0.0   0.0   0.0  0.00  0.00  0.00  0.00  0.00  0.00  0.00  0.00  1.00
5      0.0   0.0   0.0  0.00  0.00  0.00  0.00  0.00  0.00  0.00  0.00  0.00
...    ...   ...   ...   ...   ...   ...   ...   ...   ...   ...   ...   ...
1706   1.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
1707   1.0   2.0   3.0  3.33  4.33  5.33   NaN   NaN   NaN   NaN   NaN   NaN
1708   1.0   2.0   3.0  4.00   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
1709   1.0   2.0   3.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
1710   1.0   2.0   3.0  4.00  5.00  6.00   NaN   NaN   NaN   NaN   NaN   NaN

[1710 rows x 12 columns]

In [110]:
exp_going_in = exp.shift(1, axis=1)
exp_going_in

      1979  1980  1981  1982  1983  1984  1985  1986  1987  1988  1989  1990
id
1      NaN   0.0   0.0   0.0  0.00  0.58  1.33  2.33  3.33  4.33  5.33  6.33
2      NaN   0.0   0.0   0.0  0.00  0.00  0.00  0.00  0.00  0.00  0.00  1.00
3      NaN   0.0   0.0   0.0  0.00  0.00  0.00  0.00  0.00  0.00  1.00  2.00
4      NaN   0.0   0.0   0.0  0.00  0.00  0.00  0.00  0.00  0.00  0.00  0.00
5      NaN   0.0   0.0   0.0  0.00  0.00  0.00  0.00  0.00  0.00  0.00  0.00
...    ...   ...   ...   ...   ...   ...   ...   ...   ...   ...   ...   ...
1706   NaN   1.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
1707   NaN   1.0   2.0   3.0  3.33  4.33  5.33   NaN   NaN   NaN   NaN   NaN
1708   NaN   1.0   2.0   3.0  4.00   NaN   NaN   NaN   NaN   NaN   NaN   NaN
1709   NaN   1.0   2.0   3.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
1710   NaN   1.0   2.0   3.0  4.00  5.00  6.00   NaN   NaN   NaN   NaN   NaN

[1710 rows x 12 columns]

In [111]:
exp_going_in = exp_going_in.drop(['1990','1979'], axis=1)
exp_going_in

      1980  1981  1982  1983  1984  1985  1986  1987  1988  1989
id
1      0.0   0.0   0.0  0.00  0.58  1.33  2.33  3.33  4.33  5.33
2      0.0   0.0   0.0  0.00  0.00  0.00  0.00  0.00  0.00  0.00
3      0.0   0.0   0.0  0.00  0.00  0.00  0.00  0.00  0.00  1.00
4      0.0   0.0   0.0  0.00  0.00  0.00  0.00  0.00  0.00  0.00
5      0.0   0.0   0.0  0.00  0.00  0.00  0.00  0.00  0.00  0.00
...    ...   ...   ...   ...   ...   ...   ...   ...   ...   ...
1706   1.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
1707   1.0   2.0   3.0  3.33  4.33  5.33   NaN   NaN   NaN   NaN
1708   1.0   2.0   3.0  4.00   NaN   NaN   NaN   NaN   NaN   NaN
1709   1.0   2.0   3.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN
1710   1.0   2.0   3.0  4.00  5.00  6.00   NaN   NaN   NaN   NaN

[1710 rows x 10 columns]

In [112]:
exp_going_in
exp_going_in.index.name = 'id'
exp_going_in

      1980  1981  1982  1983  1984  1985  1986  1987  1988  1989
id
1      0.0   0.0   0.0  0.00  0.58  1.33  2.33  3.33  4.33  5.33
2      0.0   0.0   0.0  0.00  0.00  0.00  0.00  0.00  0.00  0.00
3      0.0   0.0   0.0  0.00  0.00  0.00  0.00  0.00  0.00  1.00
4      0.0   0.0   0.0  0.00  0.00  0.00  0.00  0.00  0.00  0.00
5      0.0   0.0   0.0  0.00  0.00  0.00  0.00  0.00  0.00  0.00
...    ...   ...   ...   ...   ...   ...   ...   ...   ...   ...
1706   1.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
1707   1.0   2.0   3.0  3.33  4.33  5.33   NaN   NaN   NaN   NaN
1708   1.0   2.0   3.0  4.00   NaN   NaN   NaN   NaN   NaN   NaN
1709   1.0   2.0   3.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN
1710   1.0   2.0   3.0  4.00  5.00  6.00   NaN   NaN   NaN   NaN

[1710 rows x 10 columns]

In [113]:
# See exp_going_in for the person with id 8 
exp_going_in.loc[8]

1980   NaN
1981   NaN
1982   NaN
1983   NaN
1984   NaN
1985   NaN
1986   NaN
1987   NaN
1988   NaN
1989   NaN
Name: 8, dtype: float64

In [114]:
exp_going_in.index.name = 'id'

panel_exp_going_in = exp_going_in.reset_index().melt(id_vars='id', var_name='Year', value_name='Experience_going_in')
panel_exp_going_in

         id  Year  Experience_going_in
0         1  1980                  0.0
1         2  1980                  0.0
2         3  1980                  0.0
3         4  1980                  0.0
4         5  1980                  0.0
...     ...   ...                  ...
17095  1706  1989                  NaN
17096  1707  1989                  NaN
17097  1708  1989                  NaN
17098  1709  1989                  NaN
17099  1710  1989                  NaN

[17100 rows x 3 columns]

In [115]:
panel_exp_going_in[(panel_exp_going_in['id']==8)]

       id  Year  Experience_going_in
7       8  1980                  NaN
1717    8  1981                  NaN
3427    8  1982                  NaN
5137    8  1983                  NaN
6847    8  1984                  NaN
8557    8  1985                  NaN
10267   8  1986                  NaN
11977   8  1987                  NaN
13687   8  1988                  NaN
15397   8  1989                  NaN

In [116]:
dummy_work.index.name = 'id'

panel_dummy_work = dummy_work.reset_index().melt(id_vars='id', var_name ='Year', value_name='Dummy_work')
panel_dummy_work

         id  Year  Dummy_work
0         1  1980           0
1         2  1980           0
2         3  1980           0
3         4  1980           0
4         5  1980           0
...     ...   ...         ...
17095  1706  1989           0
17096  1707  1989           0
17097  1708  1989           0
17098  1709  1989           0
17099  1710  1989           0

[17100 rows x 3 columns]

In [117]:
dummy_interrup = ((dummy_school == 0) & (dummy_work == 0)).astype(int)
dummy_interrup

      1980  1981  1982  1983  1984  1985  1986  1987  1988  1989
id
1        0     0     0     0     0     0     0     0     0     0
2        0     0     0     1     1     1     1     1     1     0
3        0     0     1     1     1     0     1     1     0     0
4        0     0     0     0     0     0     0     1     1     1
5        0     1     0     1     1     1     1     1     1     1
...    ...   ...   ...   ...   ...   ...   ...   ...   ...   ...
1706     1     1     1     1     1     1     1     1     1     1
1707     0     0     0     0     0     1     1     1     1     1
1708     0     0     0     0     1     1     1     1     1     1
1709     0     0     1     1     1     1     1     1     1     1
1710     0     0     0     0     0     1     1     1     1     1

[1710 rows x 10 columns]

In [118]:
dummy_interrup.index.name = 'id'

panel_dummy_interrup = dummy_interrup.reset_index().melt(id_vars='id', var_name ='Year', value_name='Dummy_interrup')
panel_dummy_interrup

         id  Year  Dummy_interrup
0         1  1980               0
1         2  1980               0
2         3  1980               0
3         4  1980               0
4         5  1980               0
...     ...   ...             ...
17095  1706  1989               1
17096  1707  1989               1
17097  1708  1989               1
17098  1709  1989               1
17099  1710  1989               1

[17100 rows x 3 columns]

In [119]:
#Experience
# Find the minimum value of the DataFrame excluding NaN values and the first column
min_value = np.nanmin(exp.iloc[:, 1:].values)

# Find the maximum value of the DataFrame excluding NaN values and the first column
max_value = np.nanmax(exp.iloc[:, 1:].values)

print("Minimum value of the DataFrame (excluding NaN values and the identifier column):", min_value)
print("Maximum value of the DataFrame (excluding NaN values and the identifier column):", max_value)

Minimum value of the DataFrame (excluding NaN values and the identifier column): 0.0
Maximum value of the DataFrame (excluding NaN values and the identifier column): 16.94

In [120]:
wage = pd.read_csv('wage.data', delim_whitespace=True, header=None, index_col=0)

In [121]:
# Rename the columns
wage.columns = new_column_names

In [122]:
wage = wage.replace(-9999, np.nan)
wage

,1979,1980,1981,1982,1983,1984,1985,1986,1987,1988,1989,1990
0,,,,,,,,,,,,
1,NaN,NaN,NaN,NaN,4.40,8.70,9.34,10.32,10.94,11.68,11.83,11.05
2,NaN,NaN,NaN,NaN,10.50,NaN,NaN,NaN,NaN,NaN,NaN,4.25
3,NaN,NaN,NaN,5.78,NaN,NaN,3.72,NaN,NaN,7.65,NaN,10.90
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,7.48,5.88,NaN,NaN
5,6.35,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
1706,NaN,NaN,6.47,5.42,5.91,6.60,NaN,NaN,NaN,NaN,NaN,NaN
1707,NaN,NaN,7.55,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1708,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1709,NaN,NaN,NaN,NaN,NaN,4.09,NaN,NaN,NaN,NaN,NaN,NaN
1710,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [123]:
wage = wage.drop(['1979','1990'], axis=1)
wage

      1980  1981  1982   1983  1984  1985   1986   1987   1988   1989
0
1      NaN   NaN   NaN   4.40  8.70  9.34  10.32  10.94  11.68  11.83
2      NaN   NaN   NaN  10.50   NaN   NaN    NaN    NaN    NaN    NaN
3      NaN   NaN  5.78    NaN   NaN  3.72    NaN    NaN   7.65    NaN
4      NaN   NaN   NaN    NaN   NaN   NaN    NaN   7.48   5.88    NaN
5      NaN   NaN   NaN    NaN   NaN   NaN    NaN    NaN    NaN    NaN
...    ...   ...   ...    ...   ...   ...    ...    ...    ...    ...
1706   NaN  6.47  5.42   5.91  6.60   NaN    NaN    NaN    NaN    NaN
1707   NaN  7.55   NaN    NaN   NaN   NaN    NaN    NaN    NaN    NaN
1708   NaN   NaN   NaN    NaN   NaN   NaN    NaN    NaN    NaN    NaN
1709   NaN   NaN   NaN    NaN  4.09   NaN    NaN    NaN    NaN    NaN
1710   NaN   NaN   NaN    NaN   NaN   NaN    NaN    NaN    NaN    NaN

[1710 rows x 10 columns]

In [124]:
wage.index.name = 'id'

panel_wage = wage.reset_index().melt(id_vars='id', var_name='Year', value_name='Wage')
panel_wage

         id  Year  Wage
0         1  1980   NaN
1         2  1980   NaN
2         3  1980   NaN
3         4  1980   NaN
4         5  1980   NaN
...     ...   ...   ...
17095  1706  1989   NaN
17096  1707  1989   NaN
17097  1708  1989   NaN
17098  1709  1989   NaN
17099  1710  1989   NaN

[17100 rows x 3 columns]

In [125]:
# Find the minimum value of the DataFrame excluding NaN values and the first column
min_value = np.nanmin(wage.iloc[:, 1:].values)

# Find the maximum value of the DataFrame excluding NaN values and the first column
max_value = np.nanmax(wage.iloc[:, 1:].values)

print("Minimum value of the DataFrame (excluding NaN values and the identifier column):", min_value)
print("Maximum value of the DataFrame (excluding NaN values and the identifier column):", max_value)

Minimum value of the DataFrame (excluding NaN values and the identifier column): 2.01
Maximum value of the DataFrame (excluding NaN values and the identifier column): 36.82

In [126]:
merged_df = pd.merge(panel_dummy_school, panel_edu_going_in, on = ['id','Year'])
merged_df = pd.merge(merged_df, panel_dummy_interrup, on = ['id','Year'])
merged_df = pd.merge(merged_df, panel_dummy_work, on = ['id','Year'])
merged_df = pd.merge(merged_df, panel_exp_going_in, on = ['id','Year'])
merged_df = pd.merge(merged_df, panel_wage, on = ['id','Year'])
# Export DataFrame to a .data file
#merged_df.sort_values(by=['id', 'Year'], inplace=True)
merged_df.to_csv('merged_data.data', sep='\t', index=False)
merged_df

,id,Year,Dummy_school,Education_going_in,Dummy_interrup,Dummy_work,Experience_going_in,Wage
0,1,1980,1,13,0,0,0.0,NaN
1,2,1980,1,9,0,0,0.0,NaN
2,3,1980,1,10,0,0,0.0,NaN
3,4,1980,1,9,0,0,0.0,NaN
4,5,1980,1,13,0,0,0.0,NaN
...,...,...,...,...,...,...,...,...
17095,1706,1989,0,10,1,0,NaN,NaN
17096,1707,1989,0,12,1,0,NaN,NaN
17097,1708,1989,0,13,1,0,NaN,NaN
17098,1709,1989,0,12,1,0,NaN,NaN
17099,1710,1989,0,12,1,0,NaN,NaN

In [127]:
merged_df.iloc[:,6]

0        0.0
1        0.0
2        0.0
3        0.0
4        0.0
        ...
17095    NaN
17096    NaN
17097    NaN
17098    NaN
17099    NaN
Name: Experience_going_in, Length: 17100, dtype: float64

In [128]:
exp.loc[10]

1979    0.00
1980    0.00
1981    1.00
1982    1.17
1983    2.06
1984    3.06
1985    3.52
1986     NaN
1987     NaN
1988     NaN
1989     NaN
1990     NaN
Name: 10, dtype: float64

In [139]:
merged_df[(merged_df['id']==8)]

,id,Year,Dummy_school,Education_going_in,Dummy_interrup,Dummy_work,Experience_going_in,Wage
7,8,1980,0,13,1,0,NaN,9.52
1717,8,1981,0,13,1,0,NaN,NaN
3427,8,1982,0,13,1,0,NaN,12.19
5137,8,1983,0,13,1,0,NaN,7.87
6847,8,1984,0,13,1,0,NaN,10.06
8557,8,1985,0,13,1,0,NaN,15.79
10267,8,1986,0,13,1,0,NaN,16.40
11977,8,1987,0,13,1,0,NaN,20.13
13687,8,1988,0,13,1,0,NaN,14.73
15397,8,1989,0,13,1,0,NaN,3.18

In [130]:
merged_df.id.unique

<bound method Series.unique of 0           1
1           2
2           3
3           4
4           5
         ...
17095    1706
17096    1707
17097    1708
17098    1709
17099    1710
Name: id, Length: 17100, dtype: int64>

In [131]:
id_1_data = merged_df[merged_df['id'] == 1]

In [132]:
id_1_data

,id,Year,Dummy_school,Education_going_in,Dummy_interrup,Dummy_work,Experience_going_in,Wage
0,1,1980,1,13,0,0,0.00,NaN
1710,1,1981,1,14,0,0,0.00,NaN
3420,1,1982,1,15,0,0,0.00,NaN
5130,1,1983,0,16,0,1,0.00,4.40
6840,1,1984,0,16,0,1,0.58,8.70
8550,1,1985,0,16,0,1,1.33,9.34
10260,1,1986,0,16,0,1,2.33,10.32
11970,1,1987,0,16,0,1,3.33,10.94
13680,1,1988,0,16,0,1,4.33,11.68
15390,1,1989,0,16,0,1,5.33,11.83

In [133]:
# Laver OLS estimation
dat = family.copy()
dat['constant'] = np.ones(family.shape[0])
dat['Family_income'] = dat['Family_income'] / 1000
# Estimerer model (1)
#For at få det rigtige intercept, trækker vi 6 fra y-værdien = highest grade completed, fordi stort set alle individer har gået 6 år i skole.
y = edu[edu.columns[-1]].values-6
X_m1 = dat[['constant','Dad_educ','Mom_educ']].values

# Print model (1)
betahat_m1 = np.linalg.inv(X_m1.T @ X_m1) @ X_m1.T @ y
print(betahat_m1.round(4))

#Print model (2)
X_m2 = dat[['constant','Dad_educ','Mom_educ','Family_income']].values
betahat_m2 = np.linalg.inv(X_m2.T @ X_m2) @ X_m2.T @ y
print(betahat_m2.round(4))

#Print model (3)
X_m3 = dat[['constant','Dad_educ','Mom_educ','Family_income','Num_siblings']].values
betahat_m3 = np.linalg.inv(X_m3.T @ X_m3) @ X_m3.T @ y
print(betahat_m3.round(4))

#Print model (4)
X_m4 = dat[['constant','Dad_educ','Mom_educ','Family_income','Num_siblings','Nuclear','Urban','South']].values
betahat_m4 = np.linalg.inv(X_m4.T @ X_m4) @ X_m4.T @ y
print(betahat_m4.round(5))

[1.15   0.2565 0.2279]
[1.307  0.22   0.1948 0.0178]
[ 2.116   0.2073  0.1776  0.0173 -0.1391]
[ 2.10043  0.20726  0.1683   0.01545 -0.14545  0.43123 -0.04957 -0.34782]

In [134]:
# Calculate residuals
res_OLS_m1 = y - X_m1@betahat_m1

# Estimate variance
K_m1 = X_m1.shape[1]
N_m1 = X_m1.shape[0]
SSR_m1 = res_OLS_m1.T@res_OLS_m1
print(SSR_m1)
sigma2_OLS_m1 = SSR_m1/(N_m1-K_m1)
var_m1 = sigma2_OLS_m1*la.inv(X_m1.T@X_m1)

# Calculate standard errors
se_m1 = np.sqrt(np.diag(var_m1)).reshape(-1,1)

# Display standard error
print("se_OLS_m1 = ",se_m1.round(2))
print(np.sqrt(var_m1.diagonal()), betahat_m1)

8470.728866248894
se_OLS_m1 =  [[0.26]
 [0.02]
 [0.03]]
[0.26393335 0.01933999 0.02729107] [1.15002725 0.25646102 0.22794135]

In [135]:
Ainv = la.inv(X_m1.T@X_m1)
u2 = res_OLS_m1 ** 2
xTu2 = X_m1.T * u2 
cov = Ainv @ (xTu2 @ X_m1) @ Ainv
se = np.sqrt(np.diag(cov))
np.diag(cov)

array([0.08159917, 0.00043539, 0.00089316])

In [136]:
# Calculate residuals
res_OLS_m2 = y - X_m2@betahat_m2

# Estimate variance
K_m2 = X_m2.shape[1]
N_m2 = X_m2.shape[0]
SSR_m2 = res_OLS_m2.T@res_OLS_m2
sigma2_OLS_m2 = (np.array(SSR_m2/(N_m2-K_m2)))
var_m2 = sigma2_OLS_m2*la.inv(X_m2.T@X_m2)

# Calculate standard errors
se_m2 = np.sqrt(var_m2.diagonal()).reshape(-1,1)

# Display standard error
print("se_OLS_m2 = ",se_m2.round(4))
print(var_m2.diagonal().round(4), betahat_m2)

se_OLS_m2 =  [[0.2591]
 [0.0194]
 [0.027 ]
 [0.0021]]
[0.0671 0.0004 0.0007 0.    ] [1.30695638 0.21995186 0.19476742 0.017803  ]

In [137]:
# Collecting results
results = {
    'Model 1': betahat_m1.round(4),
    'Model 2': betahat_m2.round(4),
    'Model 3': betahat_m3.round(4),
    'Model 4': betahat_m4.round(4)
}

# Create a list of coefficients names for the models
coef_names = ['Constant', "Dad's Education", "Mom's Education", 'Family Income', 'Number of Siblings', 'Nuclear Family', 'Urban', 'South']

# Constructing the LaTeX table
latex_table = """
\\begin{table}[H]
    \\centering
    \\begin{tabular}{lcccc}
        \\hline
        & Model 1 & Model 2 & Model 3 & Model 4 \\\\
        \\hline
"""
for i, coef in enumerate(coef_names):
    latex_table += "        {} & {} & {} & {} & {} \\\\\n".format(
        coef,
        results['Model 1'][i] if i < len(results['Model 1']) else '',
        results['Model 2'][i] if i < len(results['Model 2']) else '',
        results['Model 3'][i] if i < len(results['Model 3']) else '',
        results['Model 4'][i] if i < len(results['Model 4']) else ''
    )
latex_table += """        \\hline
    \\end{tabular}
    \\caption{OLS Estimation Results}
    \\label{tab:ols_results}
\\end{table}
"""

print(latex_table)

\begin{table}[H]
    \centering
    \begin{tabular}{lcccc}
        \hline
        & Model 1 & Model 2 & Model 3 & Model 4 \\
        \hline
        Constant & 1.15 & 1.307 & 2.116 & 2.1004 \\
        Dad's Education & 0.2565 & 0.22 & 0.2073 & 0.2073 \\
        Mom's Education & 0.2279 & 0.1948 & 0.1776 & 0.1683 \\
        Family Income &  & 0.0178 & 0.0173 & 0.0155 \\
        Number of Siblings &  &  & -0.1391 & -0.1454 \\
        Nuclear Family &  &  &  & 0.4312 \\
        Urban &  &  &  & -0.0496 \\
        South &  &  &  & -0.3478 \\
        \hline
    \end{tabular}
    \caption{OLS Estimation Results}
    \label{tab:ols_results}
\end{table}